---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationStraigtLengthOversized
source: html/7a0f6dec-2292-0375-f7ce-a3eed6c573ce.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationStraigtLengthOversized Property

Fabrication straight exceeds the standard length. Use the Optimize Length command to adjust the length.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationStraigtLengthOversized { get; }
```